docs: mermaid-ify fig 1 in core spec
